# Rpm Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Rpm Property
SymbolTypeId Class See Also
---
Symbol RPM, indicating unit Revolutions per minute.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Rpm { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Rpm As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Rpm {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace